{"data":{"site":{"siteMetadata":{"title":"eldh.co","author":"Andreas Eldh"}},"markdownRemark":{"id":"81759bf3-b5d7-5c21-a80e-d331fca97c46","html":"<p>I was at this year’s Smashing Conference in Freiburg, Germany. I had an amazing couple of days listening and talking to some of the worlds best web people.</p>\n<p>These are some of the things that stuck with me.</p>\n<h4>Performance as design</h4>\n<p>A big topic was performance. Websites are growing, and the average site is now around 1.5 MB. We are also seeing increasing use of JavaScript on scroll and touch events, which comes at a performance cost and can result in a bad experience.</p>\n<p>Performance really matters. It’s one of the key factors that determine how people use and experience the thing you are building, which of course also has a big business impact.</p>\n<h4>Death to comps</h4>\n<p>The design process was a big talking point. The rise of responsive design has led to new ways of leading the design process.</p>\n<p>One technique more commonly used is “designing in the browser” (or “deciding in the browser”), meaning more of the design process takes place in the browser rather than in Photoshop or in sketch books. This is because of the increasing complexity of web layouts, with fluid, responsive layouts, animations and more interactivity makes it hard to test in a meaningful and efficient way using traditional tools.</p>\n<p>Another talking point was “atomic design”, and the trend towards designing smaller elements and modules rather then designing full pages. For agencies this might be a significant change, since it means the deliverables will change from being some sort of full page comp (either hi-fidelity made in Photoshop or a low-fidelity wireframe) to being something like style tiles, design guide or a fully coded site.</p>\n<h4>Process/people design</h4>\n<p>Building on these changes to the design process, a lot or focus was put on the communication during the process, where it is becoming more common to deliberately create assets that steer the conversations with clients and stakeholders in the most productive direction. It’s simply put about having the right conversations at the right moment.</p>\n<p>To make this happen it is important to have the right kinds of design assets as a base for discussion – and often the right choice is to use something more lo-fi than you would usually do. Sometimes it might be a good idea to base the discussion on something other than the thing you are working on, to be able to focus more on feel and inspirations.</p>\n<p>When Microsoft launched their new responsive <a href=\"http://microsoft.com\">microsoft.com</a> many people were surprised that a company like that could pull that kind of project. Obviously it had required impressive communication skills from the design team.</p>\n<h4>Details of responsive design</h4>\n<p>Last years’ conference focused a lot on responsive design. This year the focus partly shifted towards other topics, and partly moved to the finer details of designing responsive sites, such as responsive images, modular design and responsive typography.</p>\n<h4>The things that were not there</h4>\n<p>Some things were, surprisingly or not, absent from the discussions at Smashing Conf. First of all, there was – thankfully – almost no talk about the battle between flat and skeumorphic design that has been raging in the design community.</p>\n<p>There was also surprisingly little talk about animations and movement in design. I am thinking this is still a small topic, but one that will continue to gain momentum as the web becomes a more advanced application environment.</p>\n<h3>More about the conference</h3>\n<p>Luke Wroblewski took notes during most of the talks. <a href=\"https://kippt.com/eldh/smashing-conference-lukes-notes\">Check them out here</a>.</p>\n<p>Elisabeth Irgens also did some amazing sketch notes, which you can find <a href=\"https://kippt.com/eldh/smashing-conference-sketchnotes\">here</a>.</p>\n<p>Last but not least: Many thanks to my travel companions David, Hjörtur and Anders for making this trip so much better than I could have hoped for.</p>","frontmatter":{"title":"Smashing Conference","language":"english","date":"September 17, 2013"}}},"pageContext":{"slug":"/2013-09-17-smashing-conference/","previous":{"fields":{"slug":"/2013-08-11-photography/"},"frontmatter":{"title":"The future of photography"}},"next":{"fields":{"slug":"/2013-10-14-immediate-feedback/"},"frontmatter":{"title":"Immediate feedback"}}}}