{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"757ba985-d9c8-5f14-ae7b-cfbc3bd73f5b","html":"<p><strong>“It’s not just what it looks like and feels like. Design is how it works.”</strong> <em>— Steve Jobs</em></p>\n<p>It’s a bit of a cliché to start a blog post with a Steve Jobs quote, but this quote really is a good starting point for what I want to say with this post. </p>\n<p>Design is how it works. That should mean anyone who takes decisions on how it should work is a designer.</p>\n<p>I spend most of my time writing HTML, CSS and Javascript, so I am what most people refer to as a “web developer” or “front-end developer”. I really don’t like those titles. They imply that what I do is seperate from the work of designers. Well, it’s not. </p>\n<p>I am a designer. I decide how things work, I decide how they feel and how they are percieved. Even when I don’t do graphical design or interaction design (sometimes I do that too), many of the decisions I make influence how the user will experience the product.</p>\n<p><strong>“The design/development divide is artifical.”</strong> <em>— <a href=\"https://twitter.com/aral/status/315032456644419584\">Aral Balkan</a></em></p>\n<p>In the manufacturing world, the designers would make sketches, then prototypes, then more prototypes. Then production would start. Not many decisions that influenced the outcome was left to be made after the designer had delivered a final prototype. In print design, the designer makes a design and leaves it to the printer. Not many desicions left there either. If there were details in the production stage that would impact the end product, the designer would have to become familiar with these and make the appropriate decisions beforehand.</p>\n<p>In digital design, things now work a bit differently. First, what we do is highly interactive, responsive and fluid. “How it works” is just so much more than “how it looks”. Second, we now produce one thing instead a million items based on the same design. We don’t have to decide everything before production starts. So we’re working “agile”, meaning we do things in iterations where we improve our product one small part at the time. It’s a continuous effort where building and designing are intertwined and unseperable. There is no digital equivalent of manufacturing or printing. It’s all just building things. </p>\n<p>Another part of this artificial divide between design and development is that many of today’s designers have very little knowledge of the building blocks of what s/he is designing. Any designer sholuld know the tools of his trade. A web designer who doesn’t know how CSS and Javascript works is like a furniture designer who doesn’t know the properties of different materials or a clothing designer who doesn’t know about fabrics. They will all have a hard time making good design decisions.</p>\n<p>The divide exists because we have not adapted the designer role to the digital medium. We need to accept the fact that digital design it a much wider dicipline than it has been in the past. Again, a designer is anyone who makes decisions on how the product should work. </p>\n<p>This distinction is important, because only when we have decided who can make design desicions can we forcefully pevent the wrong people from doing so. The client’s wife is not a designer. Neither is the project manager, the requirements analyst, the DBA or the test engineer.</p>\n<p>We are the designers.</p>","frontmatter":{"title":"Who is a designer?","date":null}}},"pageContext":{"slug":"/2013-03-26-who-is-a-designer/","previous":{"fields":{"slug":"/2013-05-06-check-republic/"},"frontmatter":{"title":"Check republic"}},"next":{"fields":{"slug":"/2013-01-03-nexus-4/"},"frontmatter":{"title":"Nexus 4 & switching from iPhone to Android"}}}}