{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"cbfd7059-5dd6-5b52-9c76-8198d320424d","html":"<p>Jantelagen lever onekligen, men har till viss del bytt skepnad. Det är helt ok att tro att man är något och att man kan något. Däremot är det inte ok att tycka, göra eller vara intresserad av fel saker. Man ska vara politiskt medveten, äta rätt, tänka på klimatet och vara lagom ödmjuk. Därför rörde Göran Hägglunds kampanj i somras upp så många känslor  - för Verklighetens folk är just svennarna som inte bryr sig. De ska ju motarbetas och hånas, inte omfamnas.</p>\n<p>Fredrik Lindström &#x26; Henrik Schyffert har en ny <a href=\"http://www.svd.se/kulturnoje/nyheter/fredrik-lindstrom-och-henrik-schyffert-tar-sig-an-inredningshysterin_5178877.svd\">krogshow</a> med ett enkelt tema: det är inte ok att vara intresserad av inredning. Det är inte ok att bry sig mer om sitt hem än om “världsproblemen”. Det går i samma spår som reaktionerna på DN:s artikel ”<a href=\"http://www.dn.se/bostad/vindsvaningar-har-blivit-ett-satt-att-leva-1.1185309\">Vindsvåningar har blivit ett sätt att leva</a>”, där både skribenten Sara Trus och paret som det handlar om fick utstå veckor av hån och okvädningsord från en enad twittermobb, med just Schyffert i frontlinjen.</p>\n<p>Att just inredningsintresset är mest utsatt för detta hat beror nog på att det representerar inte bara en politisk obryddhet, utan även en annan hatad egenskap - rikedom. Inte för att man nödvändigtvis måste vara politiskt ointresserad för att man vill bo vackert, men det är en ytterst opolitisk aktivitet. Just därför ses det som ett så kraftigt politiskt statement: “Jag är rik och inte intresserad”. Men samma känslor riktas mot dem som noga överväger vilken 52” platt-tv man ska köpa.</p>\n<p>Modebloggare, datorspelare, köttätare, Thailandsresenäre och rökare är bara några av de som också får en släng av sleven då och då. Jantelagen blandas med moralism och blir till en ovanligt osmaklig soppa.</p>\n<p>Det fina i kråksången är att de bespottade inte bryr sig. Det är ett krig som bara utkämpas av en sida, medan de attackerade bara vänder ryggen till. Därför kommer de också att vinna. Skulle de däremot börja försvara sig skulle de få det svårare. Det kanske är därför Kristdemokraterna bara har 3,2% i senaste opinionsmätningen.</p>\n<p>Jag passar på att puffa för fantastiska <a href=\"http://store.yankodesign.com/\">Yanko Design</a>. Där finns det grejer.</p>","frontmatter":{"title":"Individualism är inte så poppis","date":null}}},"pageContext":{"slug":"/2010-12-15-individualism-r-inte-s-poppis/","previous":{"fields":{"slug":"/test-post/"},"frontmatter":{"title":"Hello World"}},"next":null}}