{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"160cc0b5-8d4c-5ccc-92a6-a441c0735eaf","html":"<p>Efter en lite oturlig episod för några veckor sedan har jag levt mitt liv utan vad som i dagligt tal kallas “smartphone”. Här följer några korta tankar om hur detta har påverkat mig.</p>\n<p>Jag köpte min iPhone 3GS ganska snart efter att den hade kommit ut, i september 2009. Jag hade just fått jobb och min gamla Nokia hade börjat krångla. Man kan lugnt säga att detta förändrade mitt liv. Inte så fasligt mycket kanske, men ändå märkbart. Den var min kompanjon med vilken jag konsumerade tweets, bloggar, nyheter och musik, spelade spel, mätte löprundor, tog foton, mätte löprundor och checkade in såväl här som där - allt sådant som man inte kan göra med en “vanlig” telefon. Jag var en riktig iPhone-junkie helt enkelt.</p>\n<p>19 månader efter inköpet rycktes den bort från mig och jag hade att falla tillbaka på en <a href=\"http://www.gsmarena.com/sony_ericsson_k750-1090.php\">SonyEricsson K750i</a>, en riktigt bra telefon när den introducerades sex år tidigare. Men våren 2011 går det inte att komma undan att den känns något daterad. Utvecklingen har ju gått snabbare på mobilmarknaden de senaste fem åren än <a href=\"http://eldh.blogsome.com/2009/07/09/nokia-6220-classic-vs-nokia-6230/\">de fem föregående</a>.</p>\n<p>Så vad gör man då när man vant sig vid att kolla Mail, Twitter, Reeder och Facebook varje tunnelbaneresa, checka in på varje affär och alltsom oftast gå runt med hörlurar i öronen? Det som räddade min psykiska hälsa de första kritiska dagarna var nog att jag tack vare slumpens nycker precis hade köpt sex mycket läsvärda böcker som jag kunde borra ner näsan i på kollektivtrafiken. Att åka buss eller t-bana utan ha något att läsa ser jag fortfarande som helt otänkbart. Hörlurspluggen fick flytta till den lilla iPod Shuffle jag fick när jag började mitt nuvarande jobb. Den stora förändringen var dock att jag började läsa böcker, samt att jag hade lite mer att ta igen på twitter och i rss-läsaren när jag kom hem varje dag, sådant man vanligtvis fixade på vägen om man hade sin iPhone med sig. Jag rensade också ordentligt i rss-listan för att få ned antalet artiklar per dag.</p>\n<p>Dock märkte jag snabbt att mycket av de naturliga mikropauser som man har under en dag — när man väntar på någon eller något, i hissen, på busshållplatsen etc. — som jag tidigare ägnat åt telefonen nu gick åt till att vänta, fundera och studera omgivningen. Onekligen blev jag lite mer medveten om min omgivning, på gott och ont. Ibland är det ju ganska skönt att sjunka in i sig själv. Dock var min flickvän glad att jag inte kunde checka in överallt. Och jag upptäckte till min förvåning att världen inte gick under när jag inte hade kollat min twitter på en dag.</p>\n<p>Det är lite konstigt, tragiskt skulle man kunna tycka, när en förlorad liten pryl leder till en smärre livskris. Nu kanske det inte var riktigt så illa heller, men lite saker satte det hela ändå i perspektiv. En junkie som tar en vit månad kommer onekligen att komma ut på andra sidan med en del nya insikter i bagaget.</p>\n<p>Nu är jag i alla fall med smartphone igen, en ny Samsung Galaxy Ace. Jag hade väntat mig att det skulle vara en ganska stor lättnad att byta bort den gamla Ericsson-luren, men tvärtom kände jag mig besviken första dygnet. Det beror nog till stor del på att det tar ett tag att komma igång med Android. Det är mycket som ska fixas innan man får det som man vill ha det. Dessutom är luren en budgetmodell som inte direkt är blixtsnabb. Men det berodde också på att det inte var särskilt spännande, allt det där som jag brukade hålla på med.</p>\n<p>Kanske kommer jag ha ett lite mer distansierat förhållande till min telefon framöver. Kanske blir det som förut igen. Något tror jag dock att jag har lärt mig. Oavsett vilket kommer världen att snurra vidare.</p>","frontmatter":{"title":"Att leva utan iPhone","date":"April 18, 2011"}}},"pageContext":{"slug":"/2011-04-18-att-leva-utan-iphone/","previous":{"fields":{"slug":"/2011-03-31-allt-r-ett-system/"},"frontmatter":{"title":"Allt är ett system"}},"next":{"fields":{"slug":"/2011-05-15-vanligt-sunt-frnuft/"},"frontmatter":{"title":"\"Vanligt sunt förnuft\""}}}}