{"data":{"site":{"siteMetadata":{"title":"eldh.co","author":"Andreas Eldh"}},"markdownRemark":{"id":"d151ab35-60ab-581d-bf6e-f45c4f014584","html":"<p>Jag ogillar många saker, men finns det något som får mig att resa ragg lite extra så är det när någon yppar orden “vanligt sunt förnuft”. Inget annat uttryck är samtidigt så fantastiskt innehållslöst, tvetydigt och missvisande.</p>\n<p>“Sunt förnuft” används för att beskriva sådant som man tycker är så självklart att det inte behöver motiveras, förklaras eller diskuteras. Samtidigt används det i stort sett uteslutande för att döma eller nedvärdera någon som saknar detta vanliga sunda förnuft och följaktligen har gjort något som vem som helst hade kunnat lista ut var “rätt”. Om hen bara hade haft lite vanligt sunt förnuft alltså.</p>\n<p>Alla normala, vettiga människor har sunt förnuft. Om man inte håller med när någon har lagt “sunt-förnuft”-kortet saknar man uppenbarligen en grundläggande mänsklig funktion, man har i ett slag förvandlats från en resonerande individ till ett <a href=\"http://www.dn.se/ledare/kolumner/vad-ar-en-europe\">hjärndött monster</a>. Och allt skulle väl kanske vara i sin ordning om det bara var odiskutabla självklarheter som motiverades med det sunda förnuftet. Sådant som bara de mest extrema flashback-foliehattarna kunde få för sig att ifrågasätta. Well, vad tror ni det sunda förnuftet sade om till exempel rättigheter för svarta för 150 år sedan? Hur länge sedan kunde man med sunt förnuft räkna ut att homosexualitet är en sjukdom? Att kvinnor inte skulle få rösta? Vad säger det sunda förnuftet hos människor i Pakistan, Iran, Kina, Italien, Grekland eller USA? Gissningsvis finns en inte obetydlig diskrepans mellan deras uppfattning av sunt och osunt.</p>\n<p>Det sunda förnuftet är en ursäkt för att inte tänka. Det är en hänvisning till gällande normer, moral eller “magkänsla”. Det är ett sätt att säga att man är fullkomligt säker på sin sak men att man inte har en aning om varför man har rätt. Det sunda förnuftet är principlöst, fritt flytande och fördummande. Tänk efter innan du hänvisar till det.</p>","frontmatter":{"title":"\"Vanligt sunt förnuft\"","language":"swedish","date":"May 15, 2011"}}},"pageContext":{"slug":"/2011-05-15-vanligt-sunt-frnuft/","previous":{"fields":{"slug":"/2011-04-18-att-leva-utan-iphone/"},"frontmatter":{"title":"Att leva utan iPhone"}},"next":{"fields":{"slug":"/2011-07-29-gldjeddarna/"},"frontmatter":{"title":"Glädjedödarna"}}}}