{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"26235ac1-87b3-5fbd-bb6d-72cdc4fd00bd","html":"<p>Jag och Internet kom till Sverige ungefär samtidigt, för knappa 27 år sedan. Vi har växt upp tillsammans och är en naturlig del av varandras liv. Vi är generationsbröder. Vi förstår varandra. Därtill har jag alltid varit intresserad av datorer, teknik och kommunikation, både privat och yrkesmässigt.</p>\n<p>En del saker som ter sig självklara för mig verkar helt ha gått andra förbi. Det beror kanske på generationsskillnader, teknikanalfabetism eller bara brist på intresse, men många verkar inte ha reflekterat särskilt mycketöver de många sätt som Internet har förändrat samhället och oss som är en del av det.</p>\n<p>Bengt Ohlsson har en <a href=\"http://www.pastan.nu/bloggen/inlagg/3345\">krönika i gårdagens DN</a> om hur Facebook skapar en illusion av att man är social och att man har låtsasvänner istället för riktiga vänner. Det är sådant som jag vanligtvis skulle låta passera, för det är absolut ingen ny “kritik”. Tvärtom är det i princip den enda sortens kritik som har riktats mot Facebook, borträknat diverse integritetskontroverser.</p>\n<p>Jag tror att den här sortens kritik frodas på grund av en ganska basal begreppsförvirring. Kritikerna utgår från att en vänskap på Internet är samma sak som en vänskap var när de växte upp, i den “riktiga” världen. Men att bli vän någon på Facebook är inte samma sak som att vara vänner i verkliga livet. Det liknar faktiskt ingen sorts relation som funnits tidigare i historien, för att det sättet att kommunicera som har växt fram på de sociala medierna liknar inget som tidigare varit möjligt. Allt det här gäller förstås alla sorters sociala medier, men Facebook får utstå mest kritik för att där är begreppsförvirringen som störst.</p>\n<p>Jag är vän på Facebook med personer som jag aldrig träffat, som jag träffat bara ett par gånger och de som jag träffar varje dag. Det är folk som jag har mycket gemensamt med, lite gemensamt med och inget gemensamt med. Låt mig ta ett exempel på hur de här relationerna och kommunikationen kan fungera:</p>\n<p>I somras skulle jag och en vän (i ordets äldre bemärkelse) åka ut på semester i Europa. Jag skrev ett Facebookinlägg och frågade om någon ville med. En bekant som jag jobbat med året innan svarade att han också tänkt resa i Europa under samma period. Vi slog våra påsar ihop och med varsitt InterRailkort drog vi oss söderut. Under resan uppdaterade jag förstås min omvärld om var vi var och vad vi gjorde, och när jag noterade att det regnade i Prag fick jag ett meddelande från en amerikan som jag träffat ett par gånger i när jag bodde i Australien två år tidigare. Han var i Prag och hälsade på sin faster och vi bestämde oss för att träffas. Efter ett par trevliga dagar tillsammans i Prag for vi vidare.</p>\n<p>I Facebook-världen skapar man band till folk man annars sedan länge skulle ha glömt bort. Man masskommunicerar. Man har lösa relationer, relationer som skulle ha varit omöjliga utan den sortens kommunikation. Jag hade inte haft en aning om att min vän hade varit intresserad av att följa med ut i Europa, och jag hade inte haft en aning om att amerikanen var i Prag samtidigt som jag.</p>\n<p>Men de lösa relationerna behöver inte leda till fysiska möten. Även en kommentar här och där, en tumme upp när man gillar något, är en del av de lösa vänskapsband som man nu kan skapa. Dessa relationer annorlunda än vad många är vana vid, och anses därför vara mindre värda. Vissa personer som vi har relationer med på sociala nätverk är sådana som vi inte vill umgås med bortanför datorskärmen, enligt Bengt Ohlsson ett fantastiskt exempel på att allt bara är på låtsas. Men man kan ha ett relevant utbyte, även om det inte tar fysisk form. Och naturligtvis har man inte ens lust att umgås digitalt med alla gamla gymnasiekompisar. Det behöver man förstås inte heller.</p>\n<p>Den andra delen av kritiken är att facebook tränger ut det “riktiga” umgänget och ersätter det med en illusion. För det första är det att förringa värdet av nätrelationer. Det är förstås upp till var och en att bedöma olika relationer med olika personer, men att säga att alla relationer på nätet är på låtsas är inte seriöst. För det andra håller jag inte med om att fysiska relationer trängs ut. Självklart kan det bli för mycket facebook, men jag tycker generellt att nätvänskaper lever ett symbiotiskt liv med gammaldags relationer.</p>\n<p>Man måste hitta sin egen balans mellan nätrelationer och fysiska relationer, men utan att förringa någon av dem. Om man inte förstår att nya kommunikationssätt skapar nya sorters relationer kommer man, precis som Bengt Ohlsson, att undra hur man kan vara ensam om man har 1000 facebookvänner.</p>","frontmatter":{"title":"Relationer 101","date":"January 14, 2011"}}},"pageContext":{"slug":"/2011-01-14-relationer-101/","previous":{"fields":{"slug":"/2011-01-03-konsultmssighet/"},"frontmatter":{"title":"\"Konsultmässighet\""}},"next":{"fields":{"slug":"/2011-01-28-till-den-stelbenta-byrkratins-frsvar/"},"frontmatter":{"title":"Till den stelbenta byråkratins försvar"}}}}