{"data":{"site":{"siteMetadata":{"title":"eldh.co","author":"Andreas Eldh"}},"markdownRemark":{"id":"29dd92a2-72d5-56b8-b897-5cef460ba583","html":"<p>I have always worked in offices. For most part, I’ve appreciated the benefits of being at the same physical location as the rest of my team. But this winter has forced me to work from home quite a bit and it has been quite an eye-opener.</p>\n<p>When I started working from the couch, I thought I would have trouble keeping focused with all the distractions around me. I thought it would be hard to keep the dicipline. I had made sure to load up a bunch of tasks that I could take care of without interacting too much with my team, but still my expectations were pretty low.</p>\n<p>I was surprised to find that the days just flew by, and I felt really productive. Apparently I didn’t suck as much at concentrating as I did when I was trying to write my thesis. And with no one there to pull me into meetings, ask questions or just talk loudly I could really focus on what I was supposed to do.</p>\n<p>When I came back it became more obvious that I wasn’t as productive at work as I was at home. Of course, I’m not the first to experience this (I bought Rework when it came out). And I still think there is a lot of benefits to working in an office. Getting a lot of work done is not one of them though.</p>\n<p>I thought it shouldn’t be impossible to change that so I gave it some thought and I realised that it in order to reduce distractions, we would have to have some formal guidelines in place. I call it “The Zone”.</p>\n<h2>The rules</h2>\n<ul>\n<li>A person decides if and when he is in the zone, and responsible for letting others know.</li>\n<li>No one engages in a conversation with someone who is in the Zone.</li>\n<li>People in the Zone are online and responsive on Hipchat/Slack/Hangouts/Whatever.</li>\n<li>Emails are responded to at least twice daily, morning and afternoon.</li>\n<li>Anyone can join the Zone, but the whole company has to respect the rules of the Zone when communicating with its members.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Should The Zone a physical area?</strong>\nNo. The thought behind the zone is that it should work wherever you are, and in teams where only a few people are in The Zone.</p>\n<p><strong>How do you know who is in the zone?</strong>\nWe use headphones. You could try signs, stickers or funny hats. The important thing is the rules are agreed.</p>\n<p><strong>Should we communicate less?</strong>\nNo! The goal of The Zone is to enable communication that minimizes disturbances.</p>\n<p><strong>I don’t mind being disturbed.</strong>\nI do. I will try to disturb you from time to time and you can try not to disturb me.</p>\n<p><strong>Does it work?</strong>\nWe’ve done this for a couple of weeks and it’s been working out pretty well. Only a few team members wanted to be in the Zone, but everyone knows and respects the rules. It’s still harder to stay focused than it is at home, but our current office setup really is the worst ever — our team is in the middle of an open space with prople running by all the time. I expect things to improve a lot when we move to a new space next month.</p>\n<h4>Feedback</h4>\n<p>I’d like to hear thoughts on how other people have solved this problem. Talk to me on <a href=\"http://twitter.com/eldh\">twitter</a>!</p>","frontmatter":{"title":"The Zone","date":"January 25, 2015"}}},"pageContext":{"slug":"/2015-01-25-the-zone/","previous":{"fields":{"slug":"/2014-09-19-women-in-tech/"},"frontmatter":{"title":"Women in tech"}},"next":{"fields":{"slug":"/2015-07-04-react-europe-2015/"},"frontmatter":{"title":"React Europe 2015"}}}}