{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"32901360-1b2b-5391-915f-d9fe98a9e84e","html":"<p>You know all those profile and presentation texts you have to write. For every new service you write another one. Somewhere, I don’t remember where, I wrote “I live for progress”. </p>\n<p>Last year was a year of progress for me. During the last 12 months I have had the fortune of working with a lot of fun stuff and learn from amazing people. For that I am truly grateful. </p>\n<p>After working on a couple of projects that never made it to the public during 2012 I was lucky enough to build real stuff last year; stuff that people use and enjoy, now and hopefully for many years to come. I’ve learnt so much from this and I hope it has prepared me for what’s to come.</p>\n<p>The new year will incredibly exciting. I am building new things with new colleagues, and I think we can accomplish some pretty great things.</p>\n<p>The last couple of years of my career has been mostly about writing code and I’ve never really been comfortable with that. Code is never more than means to an end. I don’t care about code. I care about making stuff that help people. Tools that are better than the ones we use today. </p>\n<p>I think people need progress. We are constantly improving everything around us, like we have been since the dawn of time. The history of mankind is one of trying to make things better. Progress is a natural thing, something we take for granted. But it doesn’t just happen. It requires people to put their hard work, focus, patience and talent to good use. </p>\n<p>Making things is exciting. Let’s make some awesome things this year.</p>","frontmatter":{"title":"A year of progress","date":null}}},"pageContext":{"slug":"/2014-01-01-2013-a-year-of-progress/","previous":{"fields":{"slug":"/2014-01-06-finding-a-process/"},"frontmatter":{"title":"Finding a process"}},"next":{"fields":{"slug":"/2013-11-14-moving-on/"},"frontmatter":{"title":"Moving on"}}}}