{"data":{"site":{"siteMetadata":{"title":"eldh.co","author":"Andreas Eldh"}},"markdownRemark":{"id":"a34a7ed7-efb8-5b4b-bae0-e4cd00a899fd","html":"<p>Mattias Svensson tar i den ambitiösa debattboken Glädjedödarna sig an det så kallade förmynderiet. Boken är en kompromisslös uppgörelse med regleringar, förbud, skatter och allt annat som syftar till att styra våra fria val i någon godtycklig riktning. Den tar sin början i hans fars kamp för att driva diskotek, med danstillstånd och alkoholrestriktioner och berättar vidare om moralister i alla dess former – deras mål, medel och metoder. I det stora hela är boken mycket balanserad, välskriven och genomtänkt, och den smular förtjänstfullt sönder många av förmyndarnas argument.</p>\n<p>Men när det blir komplicerat gör Svensson det enkelt för sig. Och komplicerat blir det, framförallt när man diskuterar gränserna för det fria valet. På den filosofiskt intressanta frågan om man ska vara tillåten att sälja sig själv som slav landar Svensson i ett kategoriskt “nej”. Det är dock intressant att han inte tar med sig detta ställningstagande till exempelvis debatten om drogförbud. För när man har fastnat i ett missbruk av tunga droger kan man inte anses ha mycket kvar av sin fria vilja - man är fast i missbruket. Istället dividerar han om statistik på hur många som lyckas ta sig ur missbruk, vilket inte är överdrivet många. Hur man ska hantera de som har fastnat i sitt missbruk utan möjlighet att ta sig ur får vi inte några förslag på.</p>\n<p>Det finns all anledning att vara kritisk till drogpolitiken som den ser ut idag, inte minst det katastrofala kriget mot droger. Däremot kan man inte lämna debatten efter att detta konstaterande. En drogpolitik är och kommer vara nödvändig. I detta sammanhang skulle det vara mycket intressant att diskutera exempelvis tvångsvård, subutexprogram, LVM-hem och andra drogpolitiska åtgärder som faller utanför förbudsfållan. Men det blir säkert tid för den debatten någon annanstans.</p>\n<p>Den filosofiska frågan om huruvida man ska få sälja sitt fria val lämnar mig dock inte. Det minimala antalet som skulle kunna tänkas göra detta helt öppet är inte problemet. Problemet är att folk via sina val kommer att försätta sig i situationer där deras fria vilja är borta. Såld, sönderknarkad eller vad det vara månde. Kanske av försumbarhet, kanske av okunnighet, kanske av självdestruktivitet. Vad blir då svaret? Förbud eller inte? Mot vad i så fall? Vad det än blir, är det inte enkelt.</p>","frontmatter":{"title":"Glädjedödarna","language":"swedish","date":"July 29, 2011"}}},"pageContext":{"slug":"/2011-07-29-gldjeddarna/","previous":{"fields":{"slug":"/2011-05-15-vanligt-sunt-frnuft/"},"frontmatter":{"title":"\"Vanligt sunt förnuft\""}},"next":{"fields":{"slug":"/2011-09-13-slutet-p-photoshop-eran/"},"frontmatter":{"title":"Slutet på Photoshop-eran"}}}}