{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"955ff7fe-12c1-5613-9929-b0b23bf32fdf","html":"<p>Isobel Hadley-Kamptz twittrade igår om känsfördelningen på de som talar på internetdagarna. Jämfört med fördelningen bland alla som jobbar inom it-branschen så är andelen kvinnor på Internetdagarnas scen ungefär som man kan förvänta sig, alltså en ganska stor övervikt män.</p>\n<p>Hadley-Kamptz är vanligtvis rätt klipsk och smart, men begränsar ändå sin rapportering vid att räkna könsorgan. Nå, den analysmetoden i sig är ju inte ovanlig och man kanske inte ska begära mer i 140-teckensvärlden. Men det är så det funkar: Ska man undersöka jämställdhet så räknar man könsfördelning. Så är det bara. För oss som har jobbat inom it ett tag och faktiskt intresserar oss för frågan om varför så få kvinnor söker sig till branschen blir dock en sådan analys bara tröttsamt ytlig.</p>\n<p>Min första tanke var att det kanske finns något implicit meddelande i den statistiken. En osynlig handlingsplan som är uppenbar för den som räknar. Doktor Jämställdhet preskriberar: “Jaha, 20% kvinnor säger du, då föreskriver vi 20ml tjejer kan-kurser, 4 tabletter lönelyft och 1 rejäl dos positiv särbehandling så ska det där vara löst inom 2 till 3 år.” Är det en kritik av Internetdagarna för att de inte släpper fram tillräckligt med kvinnor? Jag känner att jag borde veta vad som menas men inte sägs. Lika outtalat men, får jag för mig, självklart är orsakerna till det rådande läget. Sexism, grabbig stämning och klanmentalitet. Eller något.</p>\n<p>Men diskussionen inom branschen har kommit längre och är tack och lov oftast mer explicit. Inte sällan läggs förslag om positiv särbehandling (senast diskuterades det om man skulle vika ett antal platser åt kvinnor innan sthlm.js senaste möte). Och varje gång kommer någon tjej in i diskussionen är säger att hon skulle bli ytterst förolämpad av att få annorlunda behandling på grund av sitt kön. Ofta ansluter folk till bägge lägren, men någon konsensus har jag inte sett tecken på.</p>\n<p>Oavsett diskussioner, särbehandling används mycket flitigt, såväl vid rekrytering som i andra sammanhang - i få branscher lär det finnas så många “tjejklubbar” som i it-branschen. Jag vågar påstå att en tjej som programmerar kommer alltid gå före en kille med samma, och ofta till och med högre, kompetens i rekryteringssituationer. Många företag har uttalade mål om att öka andelen kvinnor, vilket förstås gör att det blir lite av en huggsexa om de kvinnor som finns i branschen.</p>\n<p>Men det kanske behövs, för att kompensera för all grabbighet som skrämmer bort tjejer. Jag vet inte. Men jag har svårt att tro att tjejer väljer bort programmering på grund av att risken att behöva åka gokart med sina kollegor istället för att ha sing-a-long med Martin Stenmark, eller vad man nu gör på företagsfester i andra brancher. Kanske är det flipperspelet på kontoret som skrämmer bort kvinnorna?</p>\n<p>Sexism finns inom IT. Absolut. Men värre än i någon annan bransch? Tveksamt. <a href=\"http://laurasanders.net/a-primer-on-sexism-in-the-tech-industry-by-an-actual-girl/\">Vissa upplever inget sådant</a>, andra stöter på såväl gubbfasoner som förutfattade meningar.</p>\n<p>Jag tror knappt att det finns någon i it-branschen som inte vill se att fler tjejer söker sig hit, och jag tror också att företag såväl som individer är mer välkomnande mot kvinnor än i andra branscher. Företagen skriker efter arbetskraft och väldigt få går arbetslösa.</p>\n<p>Överlag tycker jag att de saker som görs för att locka kvinnor till it-branschen är bra och jag tror att vi är på rätt väg. Det gäller dock att vara försiktig så att man inte stirrar sig blind på vad folk har mellan benen. Om andra saker än folks kompetens får styra har vi tappat det bästa med it-branschen.</p>\n<p>Det här är ett jättespretigt inlägg. Någon annan gång kanske jag kommer skriva mer strukturerat i ämnet. Det jag egentligen ville ha sagt var att det är hög tid att överge ytliga analyser. Vi kan bättre.</p>","frontmatter":{"title":"64 män, 17 kvinnor och ett kilo mjöl. ","date":null}}},"pageContext":{"slug":"/2012-10-20-64-mn-17-kvinnor-och-ett-kilo-mjl/","previous":{"fields":{"slug":"/2013-01-03-nexus-4/"},"frontmatter":{"title":"Nexus 4 & switching from iPhone to Android"}},"next":{"fields":{"slug":"/2012-08-13-en-gammal-mobildesign/"},"frontmatter":{"title":"En gammal mobildesign"}}}}