{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"8ebe5805-a87c-556c-babe-d9892d657e3e","html":"<p>Jag är en Apple-kille. Inget att sticka under stol med. Jag har två macar och en iPhone. När jag skulle ha en ny jobbtelefon tyckte jag dock att det var dags att besöka Android-världen, för att få lite perspektiv på tillvaron. Valet föll på Samsung Galaxy Ace, en mellanklassmodell som precis börjat landa i svenska butiker.</p>\n<p>Specifikationerna är inte överdrivet imponerande men med tanke på priset (<a href=\"http://www.phonehouse.se/Mobiltelefoner/Samsung/Samsung-S5830-Galaxy-Ace\">3299:- hos Phone House</a>) får den ändå anses prisvärd. 3,5”-skärm på 320x480 pixlar, 800MHz-processor, 5Mpx-kamera med blixt och Android 2.2 Froyo med Samsungs TouchWiz-UI är väl det viktigaste.</p>\n<h2>Lådan</h2>\n<p>Med telefonen följer ett micro-SD-kort på 2 GB med tillhörande adapter, en väggladdare, en USB-kabel och en instruktionsbok. Något headset har Samsung inte kostat på sig. Snålt kan tyckas, men inget jag stör mig på eftersom jag har ett bra Klipsch-headset redan.</p>\n<h2>Utsidan</h2>   \n<p>En av sakerna som lockade hos Galaxy Ace var utseendet. Det är något inspirerat av iPhone 4, med den blanksvarta framsidan och metallbandet som går runt telefonen. Baksidan är gjord av greppvänlig gummiaktig plast med tydlig struktur. Den är lite plastig men känns ändå solid och välbyggd, dock kommer den inte i närheten av iPhone i den deltävlingen. Till och med min gamla 3GS är betydligt mer stabil en Acen. På/av-knappen sitter på högra sidan och volymknapparna på den vänstra. SD-kortet och micro-USB-uttaget sitter bakom varsina små luckor. Jag uppskattar att laddaren går in på ovansidan av telefonen. Det gör det enkelt att använda den även när den är inkopplad. Framsidan har en synlig knapp, som fungerar som hem-knapp, very iPhone-like. Det finns även två touch-knappar – ‘bakåt’ och ‘alternativ’ – som lyser upp när man håller på att klicka runt. Däremot är de inte alltid upplysta när man kan använda sig av dem, vilket är lite förvirrande. Baksidan har förutom kameran även ett par hål för högtalaren. Skärmen är inte särskilt högupplöst, men skäms inte för sig bredvid min iPhone 3GS. Färgerna känns till och med lite klarare på Galaxy Acen.</p>\n<h2>Insidan</h2>\n<p>Well, jag har bara iPhone att jämföra med. Har testat lite olika Android-lurar också, men inte tillräckligt länge för att bilda mig en riktig uppfattning om operativsystemet. TouchWiz-gränssnittet känns dock ganska intuitivt och man kommer snabbt igång. Grafiken flyter inte på lika fint som på iPhone – det hackar lite grann när man scrollar runt. Det känns som att hårdvaran är i klenaste laget. Det är dock inte värre än att det ska ses som en kosmetisk miss snarare än en funktionell. Klart bättre än andra Android-lurar jag har testat.</p>\n<p>Jag är inte helt såld på upplägget med hemskärmar och “källaren” där alla appar finns, men jag tror nog jag kommer kunna vänja mig vid det också. Det är trevligt att man kan ha widgets på hemskärmen, men det är inte alltid syftet med dem känns alldeles solklart (hur meningsfullt är det t ex att se den senaste tweeten i sin feed?). Hur man ska strukturera hemskärmen är nog något man får pröva sig fram till. Jag passade snabbt på att byta launcher till <a href=\"http://jbthemes.com/anderweb/\">ADW.launcher</a>, som är betydligt mycket snabbare och trevligare än Samsungs orginal. Rekommenderar alla att göra detsamma!</p>\n<p>Det inbyggda tangentbordet är riktigt bra. Det enda jag stör mig på är att det byter uppsättning när man skiftar mellan gemener och versaler. Jag tappar bort mig bland versalerna. IPhone-lösningen med en “lysande” shift-knapp och ständiga versaler på tangenterna känns mycket smidigare.</p>\n<h2>Android vs. Apple</h2>\n<p>Med <a href=\"http://www.doubletwist.com/\">DoubleTwist</a> går det smidigt att synka media med sin mac, även över WiFi om man skaffar <a href=\"http://www.doubletwist.com/airsync/\">AirSync-appen</a> för 32 kronor. 1-0 till Android där. Applikationsutbudet däremot känns lite skralt på Android. Dels saknas en del lite mer obskyra appar (Funbeat, Viber etc) och dels är de appar som finns ofta lite sämre. Reeder och Twitter for iPhone, som är mina två mest använda appar, har exempelvis inga likvärdiga ersättare på Android (som jag har hittat, men jag har i ärlighetens namn bara letat väldigt kort). I övrigt är inställningsmöjligheterna tilltalande många. Det är bra om man vet hur man vill ha det, men är man ingen power user tror jag nog iOS bjuder på en långt bättre användarupplevelse.</p>\n<p>Frågan är då, är den bättre eller sämre än min iPhone 3GS? Njae, jag väntar med den domen ett tag till. Gissningsvis kommer det fler delar i den här recensionen.</p>\n<p>PS. Klicka på bilden ovan för fler bilder DS.</p>","frontmatter":{"title":"Recension: Samsung Galaxy Ace","date":null}}},"pageContext":{"slug":"/2011-02-21-recension-samsung-galaxy-ace/","previous":{"fields":{"slug":"/2011-03-03-att-hitta-rtt-folk/"},"frontmatter":{"title":"Att hitta rätt folk"}},"next":{"fields":{"slug":"/2011-02-14-en-principsak/"},"frontmatter":{"title":"En principsak"}}}}